OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  String body = request->body().toString();
  DynamicJsonDocument doc(512);
  if(deserializeJson(doc, body)) {
    response->setCode(400);
    response->print(F("{\"msg\":\"bad json\"}"));
    request->send(response);
    return;
  }

  String user = doc["user"] | "";
  String pass = doc["pass"] | "";
  bool remember = doc["remember"] | false;

  // Evaluate both compares into locals before combining, so a username miss
  // doesn't short-circuit the password compare (no timing oracle).
  bool u_ok = auth_constant_time_equals(std::string(user.c_str()),
                                        std::string(effectiveAdminUser().c_str()));
  bool p_ok = auth_constant_time_equals(std::string(pass.c_str()),
                                        std::string(www_password.c_str()));
  bool ok = u_ok && p_ok;
  uint32_t tnow = authNowSecs();
  if(!ok) {
    // Correct credentials are checked above and always pass, so the throttle
    // only ever rejects *wrong* guesses — a soft lock can't shut out the admin
    // or a machine client. 429 signals the lock; the counter decays on its own.
    auth_throttle_record_failure(s_authThrottle, tnow);
    bool locked = auth_throttle_locked(s_authThrottle, tnow);
    response->setCode(locked ? 429 : 401);
    response->print(locked ? F("{\"msg\":\"locked\"}") : F("{\"msg\":\"invalid\"}"));
    request->send(response);
    return;
  }
  auth_throttle_record_success(s_authThrottle, tnow);

  // Cookies carry a wall-clock expiry, so the device needs a real clock to mint
  // one. If it has none yet (no NTP reachable, no controller RTC), adopt the
  // time the client sent with the login — the caller has just proven the
  // password, and could set the clock via /settime anyway, so this is no new
  // authority. Only ever bootstraps an *unset* clock; never moves a real one,
  // and a bogus (pre-2023) value is ignored so it can't roll the clock back.
  if(!clockIsSane()) {
    uint32_t clientNow = doc["now"] | 0u;   // epoch seconds from the browser
    if(clientNow > AUTH_CLOCK_SANE_EPOCH) {
      struct timeval tv;
      tv.tv_sec  = (time_t)clientNow;
      tv.tv_usec = 0;
      time_set_time(tv, "login");
    }
  }

  // Still no usable clock (client sent nothing / a bad value) — can't date a
  // cookie, so fall back to Basic rather than mint an unexpirable one.
  if(!clockIsSane()) {
    response->setCode(503);
    response->print(F("{\"msg\":\"clock\"}"));
    request->send(response);
    return;
  }

  String secret = web_auth_get_secret();
  if(secret.length() == 0) {
    response->setCode(503);
    response->print(F("{\"msg\":\"not ready\"}"));
    request->send(response);
    return;
  }
  uint32_t exp = (uint32_t)time(nullptr) + (remember ? REMEMBER_TTL : SESSION_TTL);
  std::string token = session_token_mint(std::string(secret.c_str()), exp);

  String cookie = "oevse_session=";
  cookie += token.c_str();
  cookie += "; Path=/; HttpOnly; SameSite=Strict";
  if(remember) { cookie += "; Max-Age="; cookie += String(REMEMBER_TTL); }
  // if(tls_active()) cookie += "; Secure";   // add when TLS status is known
  response->addHeader(F("Set-Cookie"), cookie.c_str());
  response->setCode(200);
  response->print(F("{\"msg\":\"ok\"}"));
  request->send(response);
}

void handleLogout(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response = request->beginResponseStream();
  response->setContentType(CONTENT_TYPE_JSON);
  response->addHeader(F("Cache-Control"), F("no-store"));
  if(HTTP_POST != request->method()) { response->setCode(405); request->send(response); return; }
  response->addHeader(F("Set-Cookie"), F("oevse_session=; Path=/; HttpOnly; SameSite=Strict; Max-Age=0"));
  response->setCode(200);
  response->print(F("{\"msg\":\"ok\"}"));
  request->send(response);
}

// -------------------------------------------------------------------
// Helper function to perform the standard operations on a request
// -------------------------------------------------------------------
bool requestPreProcess(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *&response, fstr_t contentType)
{
  dumpRequest(request);

  bool usedCookie = false;
  bool badCredential = false;
  if(!isAuthenticated(request, &usedCookie, &badCredential)) {
    // A wrong Basic credential presented while the throttle is hot gets 429
    // (rate-limited), so brute forcing GET /status is throttled the same as
    // POST /login. A request with no credential at all still gets the normal
    // 401 challenge — the throttle only ever answers *failed* attempts.
    if(badCredential && auth_throttle_locked(s_authThrottle, authNowSecs())) {
      response = request->beginResponseStream();
      response->setContentType(CONTENT_TYPE_JSON);
      response->setCode(429);
      response->print(F("{\"msg\":\"locked\"}"));
      request->send(response);
      return false;
    }
    MongooseString xrw = request->headers("X-Requested-With");
    if(xrw.equals("OpenEVSE")) {
      response = request->beginResponseStream();
      response->setContentType(CONTENT_TYPE_JSON);
      response->setCode(401);
      response->print(F("{\"msg\":\"auth\"}"));
      request->send(response);
    } else {
      request->requestAuthentication(esp_hostname);
    }
    return false;
  }

  // CSRF: a browser session cookie is auto-attached cross-site, so any
  // state-changing (non-GET) request authenticated via cookie must also carry
  // the SPA's custom header, which a cross-origin form cannot set. Basic-auth
  // (machine) clients never send our cookie and are unaffected.
  if(request->method() != HTTP_GET && usedCookie) {
    MongooseString xrw = request->headers("X-Requested-With");
    if(!(xrw.equals("OpenEVSE"))) {
      response = request->beginResponseStream();
      response->setContentType(CONTENT_TYPE_JSON);
      response->setCode(403);
      response->print(F("{\"msg\":\"csrf\"}"));
      request->send(response);
      return false;
    }
  }

  response = request->beginResponseStream();
  response->setContentType(contentType);

  if(enableCors) {
    response->addHeader(F("Access-Control-Allow-Origin"), F("*"));
    response->addHeader(F("Access-Control-Allow-Headers"), F("*"));
    response->addHeader(F("Access-Control-Allow-Methods"), F("*"));
  }

  response->addHeader(F("Cache-Control"), F("no-cache, private, no-store, must-revalidate, max-stale=0, post-check=0, pre-check=0"));

