OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  DBUGF("Starting WiFi scan");
  bool scanStarted = net.wifiScanNetworks([request, response](int networksFound) {
    DBUGF("%d networks found", networksFound);
    response->print("[");
    for (int i = 0; i < networksFound; ++i) {
      if(i) response->print(",");
      StaticJsonDocument<256> network;
      network["rssi"] = WiFi.RSSI(i);
      network["ssid"] = WiFi.SSID(i);
      network["bssid"] = WiFi.BSSIDstr(i);
      network["channel"] = WiFi.channel(i);
      network["secure"] = WiFi.encryptionType(i);
      serializeJson(network, *response);
    }
    response->print("]");
    request->send(response);
  });

  if(!scanStarted) {
    DBUGLN("WiFi scan failed to start");
    response->print("[]");
    request->send(response);
  }
}

// -------------------------------------------------------------------
// Destructive actuators (/reset, /restart, /apoff, /divertmode, /shaper,
// /settime, /rfid/add) must not fire from a bare cross-site GET (e.g.
// <img src="/reset">). Require either a non-GET method or
// the SPA's custom header, which a cross-origin GET cannot set — defense in
// depth beyond SameSite=Strict on the worst-consequence endpoints. Sends 403
// and returns false when the request is a headerless GET; the caller's response
// stream is already open (from requestPreProcess).
// -------------------------------------------------------------------
static bool actuatorMethodAllowed(MongooseHttpServerRequest *request,
                                  MongooseHttpServerResponseStream *response)
{
  if(request->method() != HTTP_GET) {
    return true;
  }
  MongooseString xrw = request->headers("X-Requested-With");
  if(xrw.equals("OpenEVSE")) {
    return true;
  }
  response->setCode(403);
  response->print("Forbidden: use POST or the app");
  request->send(response);
  return false;
}

// -------------------------------------------------------------------
// Handle turning Access point off
// url: /apoff
// -------------------------------------------------------------------
void
handleAPOff(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  response->setCode(200);
  response->print("Turning AP Off");
  request->send(response);

  DBUGLN("Turning AP Off");
  apOffTime = millis() + 1000;
}

// -------------------------------------------------------------------
// Change divert mode (solar PV divert mode) e.g 1:Normal (default), 2:Eco
// url: /divertmode
// -------------------------------------------------------------------
void
handleDivertMode(MongooseHttpServerRequest *request){
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  DivertMode divertmode = (DivertMode)(request->getParam("divertmode").toInt());
  divert.setMode(divertmode);

  response->setCode(200);
  response->print("Divert Mode changed");
  request->send(response);

  DBUGF("Divert Mode: %d", divertmode);
}

// -------------------------------------------------------------------
// Change current shaper mode 0:disable (default), 1:Enable
// url: /shaper
// -------------------------------------------------------------------
void
handleCurrentShaper(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  shaper.setState(request->getParam("shaper").toInt() == 1? true: false);

  response->setCode(200);
  response->print("Current Shaper state changed");
  request->send(response);

  DBUGF("CurrentShaper: %d", shaper.getState());
}

// -------------------------------------------------------------------
// Manually set the time
// url: /settime
// -------------------------------------------------------------------
void handleSetTime(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  handleTimePost(request, response);

  request->send(response);
}

// -------------------------------------------------------------------
// Get Tesla Vehicle Info
// url: /teslaveh
// -------------------------------------------------------------------
void
handleTeslaVeh(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  StaticJsonDocument<1024> doc;
  int count = teslaClient.getVehicleCnt();
  doc["count"] = count;
  JsonArray vehicles = doc.createNestedArray("vehicles");

  for (int i = 0; i < count; i++)
  {
    JsonObject vehicle = vehicles.createNestedObject();
    vehicle["id"] = teslaClient.getVehicleId(i);
    vehicle["name"] = teslaClient.getVehicleDisplayName(i);
  }

  response->setCode(200);
  serializeJson(doc, *response);
  request->send(response);
}

// -------------------------------------------------------------------
// Whether vehicle telemetry pushed to POST /status should be accepted.
//
// The four vehicle fields below each repeated the same source comparison, which
// is one copy-paste away from a field that quietly accepts a push it should
// not, or rejects one it should. Naming the rule once means the next field
// added here inherits it rather than restating it.
//
// Sources that own the vehicle data themselves are excluded on purpose: a push
// must not be able to fight a source that is actively fetching the same values.
// -------------------------------------------------------------------
static bool vehiclePushAccepted()
{
  return VEHICLE_DATA_SRC_HTTP == vehicle_data_src;
}

// -------------------------------------------------------------------
// Returns status json
// url: /status
// -------------------------------------------------------------------
void handleStatusPost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();
  // Deserialize the JSON document
  const size_t capacity = JSON_OBJECT_SIZE(32) + 1024;
  DynamicJsonDocument doc(capacity);
  DeserializationError error = deserializeJson(doc, body);
  if(!error)
  {
    bool send_event = true;

