OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
    if(doc.containsKey("voltage"))
    {
      double volts = doc["voltage"];
      DBUGF("voltage:%.1f", volts);
      evse.setVoltage(volts);
    }
    if(doc.containsKey("shaper_live_pwr"))
    {
      double shaper_live_pwr = doc["shaper_live_pwr"];
      shaper.setLivePwr(shaper_live_pwr);
      DBUGF("shaper: live power:%dW", shaper.getLivePwr());
    }
    if(doc.containsKey("solar")) {
      divert.setSolar(doc["solar"]);
      DBUGF("solar:%dW", divert.getSolar());
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    else if(doc.containsKey("grid_ie")) {
      divert.setGridIe(doc["grid_ie"]);
      DBUGF("grid:%dW", divert.getGridIe());
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    if(doc.containsKey("battery_level") && vehiclePushAccepted()) {
      double vehicle_soc = doc["battery_level"];
      DBUGF("vehicle_soc:%d%%", vehicle_soc);
      evse.setVehicleStateOfCharge(vehicle_soc);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("battery_range") && vehiclePushAccepted()) {
      double vehicle_range = doc["battery_range"];
      DBUGF("vehicle_range:%dKM", vehicle_range);
      evse.setVehicleRange(vehicle_range);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("time_to_full_charge") && vehiclePushAccepted()){
      double vehicle_eta = doc["time_to_full_charge"];
      DBUGF("vehicle_eta:%d", vehicle_eta);
      evse.setVehicleEta(vehicle_eta);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("vehicle_charge_limit") && vehiclePushAccepted()){
      int vehicle_charge_limit = doc["vehicle_charge_limit"];
      DBUGF("vehicle_charge_limit:%d%%", vehicle_charge_limit);
      evse.setVehicleChargeLimit(vehicle_charge_limit);
      doc["vehicle_state_update"] = 0;
    }
    // Display-only home/powerwall battery feeds. Like the solar/grid pushes
    // above these are an explicit override (no data_src arbitration); they just
    // surface in /status and on the display.
    if(doc.containsKey("home_battery_soc")) {
      int soc = doc["home_battery_soc"];
      DBUGF("home_battery_soc:%d%%", soc);
      home_battery_set_soc(soc);
    }
    if(doc.containsKey("home_battery_power")) {
      int power = doc["home_battery_power"];
      DBUGF("home_battery_power:%dW", power);
      home_battery_set_power(power);
    }
    // send back new value to clients
    if(send_event) {
      event_send(doc);
    }
    response->setCode(200);
    serializeJson(doc, *response);
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Could not parse JSON\"}");
  }
}


void
handleStatus(MongooseHttpServerRequest *request)
{

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  if(HTTP_GET == request->method()) {

    // Allocated once and reused. Building a fresh multi-KB document per
    // request, freed again immediately, is what fragments this heap: measured
    // on hardware, sustained polling of /status alone drove the largest
    // allocatable block from 61,428 down to 38,900 and it never recovered,
    // while total free heap stayed above 70KB.
    //
    // Safe as a static because Mongoose is polled from loop() on a single
    // task and each handler runs to completion inside its own event callback;
    // this one calls nothing that re-enters the HTTP layer.
    static DynamicJsonDocument doc(STATUS_JSON_CAPACITY);
    doc.clear();

    uint32_t probe = diagnostics_probe_begin();
    buildStatus(doc);
    diagnostics_probe_end(0, probe);

    response->setCode(200);
    probe = diagnostics_probe_begin();
    // Serialise into a right-sized buffer and hand the stream one write.
    // Writing incrementally makes the stream's mbuf realloc up a 1.5x ladder
    // (128->192->288->...->2187 for a 1.7KB body): eight ascending
    // allocate/free pairs per request, which is what shreds the heap. One
    // reserved String plus one write is two exact-sized allocations.
    String json;
    json.reserve(measureJson(doc) + 1);
    serializeJson(doc, json);
    response->write((const uint8_t *)json.c_str(), json.length());
    diagnostics_probe_end(1, probe);

  } else if(HTTP_POST == request->method()) {
    handleStatusPost(request, response);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

// -------------------------------------------------------------------
//
// url: /schedule
// -------------------------------------------------------------------
void
handleScheduleGet(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response, uint16_t event)
{
  // Sized from the stored event count — a fixed budget silently truncated
  // multi-rule schedules (serialize() drops events once the doc overflows).
  DynamicJsonDocument doc(scheduler.scheduleJsonCapacity());

  bool success = (SCHEDULER_EVENT_NULL == event) ?
    scheduler.serialize(doc) :
    scheduler.serialize(doc, event);

  if(success) {
    response->setCode(200);
    serializeJson(doc, *response);
  } else {
    response->setCode(404);
    response->print("{\"msg\":\"Not found\"}");
  }
}

void
handleSchedulePost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response, uint16_t event)
{
  String body = request->body().toString();

  bool success = (SCHEDULER_EVENT_NULL == event) ?
    scheduler.deserialize(body) :
    scheduler.deserialize(body, event);

  if(success) {
    response->setCode(200);
    response->print("{\"msg\":\"done\"}");
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Could not parse JSON\"}");
  }
}

void
handleScheduleDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response, uint16_t event)
{
  if(SCHEDULER_EVENT_NULL != event)
  {
    if(scheduler.removeEvent(event)) {
      response->setCode(200);
      response->print("{\"msg\":\"done\"}");
    } else {
      response->setCode(404);
      response->print("{\"msg\":\"Not found\"}");
    }
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }
}

#define SCHEDULE_PATH_LEN (sizeof("/schedule/") - 1)

void
handleSchedule(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  uint16_t event = SCHEDULER_EVENT_NULL;

