OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
    // Not routed through requestPreProcess: that opens a buffered stream
    // response, and the whole point here is to send from a flash mapping
    // instead of buffering the image in a heap that has no room for it.
    if(!isAuthenticated(request)) {
      request->requestAuthentication(esp_hostname);
      return;
    }

    const uint8_t *data = NULL;
    size_t len = 0;
    if(!diagnostics_coredump_image(&data, &len)) {
      MongooseHttpServerResponseStream *response = request->beginResponseStream();
      response->setContentType(CONTENT_TYPE_JSON);
      response->setCode(404);
      response->print(F("{\"msg\":\"none\"}"));
      request->send(response);
      return;
    }

    MongooseHttpServerResponseBasic *response = request->beginResponse();
    response->setCode(200);
    response->setContentType("application/octet-stream");
    response->setContentLength(len);
    response->addHeader(F("Content-Disposition"), F("attachment; filename=\"coredump.bin\""));
    response->addHeader(F("Cache-Control"), F("no-store"));
    response->setContent(data, len);
    request->send(response);
  });

  server.on("/debug/console")
    ->onRequest(onWsAuthenticate)
    ->onFrame([](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
      // Intentionally no-op: this endpoint is server-push only via SerialDebug.onWrite.
  });

  SerialDebug.onWrite([](const uint8_t *buffer, size_t size)
  {
    web_server_send_all("/debug/console", buffer, size);
  });

  server.on("/evse", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialEvse.printBuffer(*response);
    request->send(response);
  });

  server.on("/evse/console", [](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
    // Intentionally no-op: this endpoint is server-push only via SerialEvse callbacks.
  })->onConnect([](MongooseHttpWebSocketConnection *connection) {
    wsAuthorise(connection);
  });

  SerialEvse.onWrite([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });
  SerialEvse.onRead([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });

  // onWsConnect() applies the auth gate; see wsAuthorise().
  server.on("/ws", onWsFrame)->onConnect(onWsConnect);
}

void web_server_setup()
{
  http_server_started = false;
  https_server_started = false;

  bool use_ssl = false;
  if(config_https_enabled() && www_certificate_id != "")
  {
    uint64_t cert_id = std::stoull(www_certificate_id.c_str(), nullptr, 16);
    const char *cert = certs.getCertificate(cert_id);
    const char *key = certs.getKey(cert_id);
    if(NULL != cert && NULL != key)
    {
      DEBUG.printf("Starting HTTPS server, https://0.0.0.0:%d\n", www_https_port);
      https_server.begin(www_https_port, cert, key);
      registerWebServerRoutes(https_server);
      https_server.onNotFound(handleNotFound);
      https_server_started = true;
      use_ssl = true;
    }
  }

  // Keep HTTP reachable whenever HTTPS is unavailable, so we never strand the UI.
  const bool should_start_http = config_http_enabled() || false == use_ssl;
  const bool should_bind_http_port = false == use_ssl || www_http_port != www_https_port;
  if(should_start_http && should_bind_http_port) {
      DEBUG.printf("Starting HTTP server, http://0.0.0.0:%d\n", www_http_port);
      http_server.begin(www_http_port);
      registerWebServerRoutes(http_server);
      http_server.onNotFound(handleNotFound);
      http_server_started = true;
  }

  DEBUG.println("Server started");
}

void
web_server_loop() {
  Profile_Start(web_server_loop);

  // Do we need to restart the WiFi?
  if(wifiRestartTime > 0 && millis() > wifiRestartTime) {
    wifiRestartTime = 0;
    net.wifiRestart();
  }

  // Do we need to turn off the access point?
  if(apOffTime > 0 && millis() > apOffTime) {
    apOffTime = 0;
    net.wifiTurnOffAp();
  }

  Profile_End(web_server_loop, 5);
}

void web_server_event(JsonDocument &event)
{
  String json;
  // Reserve up front: the default String growth pattern reallocates on almost
  // every append, and exact-fit reallocs at this frequency are what shreds the
  // heap into unusable fragments.
  json.reserve(measureJson(event) + 1);
  serializeJson(event, json);

  // Drop any client that has stopped draining before adding to its backlog.
  diagnostics_ws_reap();

  if(http_server_started) {
    http_server.sendAll("/ws", json);
  }
  if(https_server_started) {
    https_server.sendAll("/ws", json);
  }
}
